/// SPDX-LICENSE-IDENTIFIER: GPL2.0
///
/// (C) All rights reserved. Author: <kisfg@hotmail.com> in 2025
/// Created at 2025年08月09日 星期六 23时12分59秒
/// Last modified at 2025年08月10日 星期日 16时16分34秒
let a = {
	aa: 1,
	pa: 2,
	$a: "sir, what's your name?\n",
	𗨀𗨁𗨂𗨃𗨄𗨅𗨆𗨇𗨈𗨉𗨊𗨋𗨌𗨍𗨎𗨏𗨐𗨑𗨒𗨓𗨔𗨕𗨖𗨗𗨘𗨙𗨚𗨛𗨜𗨝𗨞𗨟𗨠𗨡𗨢𗨣𗨤𗨥𗨦𗨧𗨨𗨩𗨪𗨫𗨬𗨭𗨮𗨯𗨰𗨱𗨲𗨳𗨴𗨵𗨶𗨷𗨸𗨹𗨺𗨻𗨼𗨽𗨾𗨿𗩀𗩁𗩂𗩃𗩄𗩅𗩆𗩇𗩈𗩉𗩊𗩋𗩌𗩍𗩎𗩏𗩐𗩑𗩒𗩓𗩔𗩕𗩖𗩗𗩘𗩙𗩚𗩛𗩜𗩝𗩞𗩟𗩠𗩡𗩢𗩣𗩤𗩥𗩦𗩧𗩨𗩩𗩪𗩫𗩬𗩭𗩮𗩯𗩰𗩱𗩲𗩳𗩴𗩵𗩶𗩷𗩸𗩹𗩺𗩻𗩼𗩽𗩾𗩿𗪀𗪁𗪂𗪃𗪄𗪅𗪆𗪇𗪈𗪉𗪊𗪋𗪌𗪍𗪎𗪏𗪐𗪑𗪒𗪓𗪔𗪕𗪖𗪗𗪘𗪙𗪚𗪛𗪜𗪝𗪞𗪟𗪠𗪡𗪢𗪣𗪤𗪥𗪦𗪧𗪨𗪩𗪪𗪫𗪬𗪭𗪮𗪯𗪰𗪱𗪲𗪳𗪴𗪵𗪶𗪷𗪸𗪹𗪺𗪻𗪼𗪽𗪾𗪿𗫀𗫁𗫂𗫃𗫄𗫅𗫆𗫇𗫈𗫉𗫊𗫋𗫌𗫍𗫎𗫏𗫐𗫑𗫒𗫓𗫔𗫕𗫖𗫗𗫘𗫙𗫚𗫛𗫜𗫝𗫞𗫟𗫠𗫡𗫢𗫣𗫤𗫥𗫦𗫧𗫨𗫩𗫪𗫫𗫬𗫭𗫮𗫯𗫰𗫱𗫲𗫳𗫴𗫵𗫶𗫷𗫸𗫹𗫺𗫻𗫼𗫽𗫾𗫿: "123",
	$123: "my name is David Kin\n"
}

console.log(a.$a)
console.log(a.$123)
console.log(
	"\u1012𗬀𗬁𗬂𗬃𗬄𗬅𗬆𗬇𗬈𗬉𗬊𗬋𗬌𗬍𗬎𗬏𗬐𗬑𗬒𗬓𗬔𗬕𗬖𗬗𗬘𗬙𗬚𗬛𗬜𗬝𗬞𗬟",
	'𗬠𗬡𗬢𗬣𗬤𗬥𗬦𗬧𗬨𗬩𗬪𗬫𗬬𗬭𗬮𗬯𗬰𗬱𗬲𗬳𗬴𗬵𗬶𗬷𗬸𗬹𗬺𗬻𗬼𗬽𗬾𗬿𗭀𗭁𗭂𗭃𗭄',
	`𗭅𗭆𗭇𗭈𗭉𗭊𗭋𗭌𗭍𗭎𗭏𗭐𗭑𗭒𗭓𗭔𗭕𗭖𗭗𗭘𗭙𗭚𗭛𗭜𗭝𗭞𗭟𗭠𗭡𗭢𗭣𗭤𗭥𗭦𗭧𗭨𗭩𗭪𗭫𗭬𗭭𗭮𗭯𗭰𗭱𗭲𗭳𗭴𗭵𗭶𗭷𗭸𗭹𗭺𗭻𗭼𗭽𗭾𗭿𗮀𗮁𗮂𗮃𗮄𗮅𗮆𗮇𗮈𗮉𗮊𗮋𗮌𗮍𗮎𗮏𗮐𗮑𗮒𗮓𗮔𗮕𗮖𗮗𗮘𗮙𗮚𗮛𗮜𗮝𗮞𗮟𗮠𗮡𗮢𗮣𗮤𗮥𗮦𗮧𗮨𗮩𗮪𗮫𗮬𗮭𗮮𗮯𗮰𗮱𗮲𗮳𗮴𗮵𗮶𗮷𗮸𗮹𗮺𗮻𗮼𗮽𗮾𗮿𗯀𗯁𗯂𗯃𗯄𗯅𗯆𗯇𗯈𗯉𗯊𗯋𗯌𗯍𗯎𗯏𗯐𗯑𗯒𗯓𗯔𗯕𗯖𗯗𗯘𗯙𗯚𗯛𗯜𗯝𗯞𗯟𗯠𗯡𗯢𗯣𗯤𗯥𗯦𗯧𗯨𗯩𗯪𗯫𗯬𗯭𗯮𗯯𗯰𗯱𗯲𗯳𗯴𗯵𗯶𗯷𗯸𗯹𗯺𗯻𗯼𗯽𗯾𗯿`
)
